OdGeContext.gFreeMem
A function pointer to a user-defined memory allocation function
for all delete operations in the OdGe library.
\remarks
Allows the OdGe library to use the same memory manager as the user application.
\param memBlock [in]  Allocated memory block to be freed.

OdGeContext.gAllocMem
\details
A function pointer to a user-defined memory allocation function
for all new operations in the OdGe library.
\remarks
Allows the OdGe library to use the same memory manager as the user application.
\param size [in]  Size in bytes to allocate.

OdGeContext.gErrorFunc
\details
A function pointer to a user-defined error handler.
\remarks
By default, points to a function that does nothing but return.

OdGeContext.gZeroTol
\details
Provides the global 0.0 default OdGeTol tolerance object.
\remarks
gZeroTol.equalPoint == 0.0 and gZeroTol.equalVector == 1.e-10.

OdGeContext.gTol
\details
Provides the global default OdGeTol tolerance object.
\remarks
gTol.equalPoint == 1e-10  gTolequalVector == 1.e-10.